{
	"recipes": [{
		"id": 1,
		"name": "Bourbon-Butter-Salted Pecan Ice Cream",
		"category": "Dessert",
		"image": "images/bourbon-butter-salted-pecan-ice-cream-sl.jpg",
		"createdBy": "Pam Lolley",
		"createdOn": "04.05.2016",
		"rating": 4,
		"preparationTime": "6 Hours",
		"yield": "Makes about 1 qt",
		"ingredients": "1 (14-oz.) can sweetened condensed milk, 1 (5-oz.) can evaporated milk, 2 cups whole milk, 2 tablespoons sugar, 2 teaspoons vanilla extract, 1/8 teaspoon table salt, 1 cup coarsely chopped pecans, 1/2 tablespoon butter, 1/4 teaspoon kosher salt, 2 tablespoons bourbon",
		"description": "Try a small twist on classic Butter-Pecan Ice Cream by adding a couple tablespoons of bourbon.",
		"preparation": "Whisk together first 6 ingredients; cover and chill 2 hours. Pour milk mixture into freezer container of a 1-qt. electric ice-cream maker, and freeze according to manufacturer's instructions. (Instructions and times will vary.) Remove container with ice cream from ice-cream maker, and freeze 30 minutes. Meanwhile, cook pecans and butter in a small skillet over medium heat, stirring constantly, 7 to 8 minutes or until toasted and fragrant. Spread pecans on wax paper, and sprinkle with kosher salt; cool completely. Stir pecans and bourbon into prepared ice-cream mixture. Transfer mixture to an airtight container or a loaf pan covered tightly with aluminum foil; freeze 3 to 4 hours or until firm."
	}, {
		"id": 2,
		"name": "Blueberry-Cheesecake Ice Cream",
		"category": "Dessert",
		"image": "images/blueberry-cheesecake-ice-cream-sl-x.jpg",
		"createdBy": "Hector Sanchez",
		"createdOn": "25.02.2016",
		"rating": 4,
		"preparationTime": "3 Hours",
		"yield": "Makes about 1 qt",
		"ingredients": "1 (8-oz.) package cream cheese, softened to room temperature, 1 1/2 cups half and half, 3/4 cup sugar, 1/2 cup whole buttermilk, 1 1/2 teaspoons vanilla bean paste, 1/4 teaspoon almond extract, 1/8 teaspoon salt, 1 cup fresh blueberries, 3 tablespoons blueberry preserves, 2 teaspoons lemon zest",
		"description": "No custard is needed to make this easy Blueberry-Cheesecake Ice Cream. Try Blueberry-Cheesecake Ice Cream in cookie sandwiches or irresistible pies.",
		"preparation": "Process first 7 ingredients in a blender 30 seconds or until very smooth. Cover and chill at least 2 hours or up to 2 days. Pour mixture into freezer container of a 1 1/2-qt. electric ice-cream maker, and freeze according to manufacturer's instructions. (Instructions and times may vary.) Mash together blueberries, blueberry preserves, and lemon zest. Stir mixture into prepared ice cream. Freeze 1 hour before serving. Serve immediately, or transfer to an airtight container, and freeze up to 1 week."
	}, {
		"id": 3,
		"name": "Strawberry-Basil Ice Cream",
		"category": "Dessert",
		"image": "images/strawberry-basil-ice-cream-sl.jpg",
		"createdBy": "Hector Sanchez",
		"createdOn": "07.09.2015",
		"rating": 3,
		"preparationTime": "6 Hours",
		"yield": "Makes about 1 qt",
		"ingredients": "1 (14-oz.) can sweetened condensed milk, 1 (5-oz.) can evaporated milk, 1 1/2 cups whole milk, 2 tablespoons sugar, 1/8 teaspoon table salt, 1 (16-oz.) container fresh strawberries, coarsely chopped, 2 tablespoons chopped fresh basil, 2 tablespoons fresh lemon juice",
		"description": "Fresh strawberries and basil become a refreshing treat in this summertime ice cream recipe.",
		"preparation": "Whisk together first 6 ingredients; cover and chill 2 hours. Meanwhile, pulse strawberries, basil, and lemon juice in a food processor 5 or 6 times or until finely chopped. Stir strawberry mixture into chilled milk mixture. Pour milk mixture into freezer container of a 1-qt. electric ice-cream maker, and freeze according to manufacturer's instructions. (Instructions and times will vary.) Remove container with ice cream from ice-cream maker, and freeze 30 minutes. Transfer mixture to an airtight container or a loaf pan covered tightly with aluminum foil; freeze 3 to 4 hours or until firm."
	}, {
		"id": 4,
		"name": "Shrimp, Snap Pea, and Chervil Salad",
		"category": "Salad",
		"image": "images/shrimp-snap-pea-chervil-salad-su-x.jpg",
		"createdBy": "Annabelle Breakey",
		"createdOn": "07.07.2015",
		"rating": 5,
		"preparationTime": "40 Minutes",
		"yield": "Serves 4 (makes 6 1/2 cups) (serving size: 1 1/2 cups)",
		"ingredients": "8 ounces sugar snap peas, strings removed (snap each pea's stem and pull down sharply along the straight side), cut diagonally into 1-in. pieces, 1/4 cup plus 1 1/2 tsp. anise-flavored liqueur, such as Pernod, 1 tablespoon plus 3/4 tsp. kosher salt, 2 bay leaves, 1 lemon, halved, plus 3 tbsp. juice, 1 pound medium (36 to 42 per lb.) raw peeled and deveined shrimp, 3 tablespoons extra-virgin olive oil, 1 1/2 tablespoons mayonnaise, 3/4 teaspoon pepper, 1/2 cup chopped chervil*, plus 1/2 cup small chervil sprigs (1 3/4 oz. total), 6 medium radishes, sliced, 1 small fennel bulb, trimmed and thinly sliced, Leaves from 1 small head butter lettuce",
		"description": "This salad is easy to vary depending on what you have on hand; crumbled fresh goat cheese, chicken, or smoked trout can all be subbed in for the shrimp. It's especially refreshing when the ingredients are cold.",
		"preparation": "Bring a large saucepan of salted water to a boil. Fill a large bowl with ice water. Boil snap peas until bright green (15 to 20 seconds), then drain. Rinse with cold water and add to ice water. Meanwhile, in another large saucepan, combine 1/4 cup liqueur, 1 tbsp. salt, the bay leaves, and 1 qt. water. Squeeze juice from lemon halves into pan and add halves as well. Bring to a boil, stir in shrimp, and remove from heat. Let stand until shrimp are cooked through, about 3 minutes. Drain, rinse shrimp with cold water, and add to ice water with peas. Let stand until cold, then drain peas and shrimp well. Whisk remaining 1 1/2 tsp. liqueur, 3 tbsp. lemon juice, the oil, mayonnaise, remaining 3/4 tsp. salt, and the pepper in a large bowl. Add peas, shrimp, chervil, radishes, and fennel, tossing to coat. Serve with lettuce for people to use as a base for their salads if they like."
	}, {
		"id": 5,
		"name": "Grilled Salmon Caesar Salad",
		"category": "Salad",
		"image": "images/grilled-salmon-caesar-salad-cl-x.jpg",
		"createdBy": "Stephen Devries",
		"createdOn": "29.04.2016",
		"rating": 4,
		"preparationTime": "25 Minutes",
		"yield": "Makes 4 servings",
		"ingredients": "4 (6-ounce) skin-on sockeye salmon fillets, 2 tablespoons olive oil, 3/4 teaspoon salt, 1/2 teaspoon freshly ground black pepper, 3 Romaine lettuce hearts, torn, 1 bunch radishes, halved, Lemony Caesar Dressing, Garnishes: chopped fresh chives, Parmesan cheese shavings",
		"description": "Quick and easy Grilled Salmon Caesar Salad (ready in less than 25 minutes and in only two steps!) is colorful, tasty, and healthy. Make the Lemony Caesar Dressing ahead of time to make this salad come together even more quickly.",
		"preparation": "Preheat grill to high heat (400° to 450°). Brush salmon on both sides with oil; sprinkle with salt and pepper. Grill salmon fillets, skin sides up, 5 minutes. Turn fillets, and cook 3 minutes or until opaque but still tender in center. Remove skin from fillets. Toss lettuce and radishes with Lemony Caesar Dressing, and divide among 4 plates. Top with salmon; garnish, if desired."
	}, {
		"id": 6,
		"name": "Grilled Chicken-and-Strawberry Salad",
		"category": "Salad",
		"image": "images/grilled-chicken-strawberry-salad-cl-x.jpg",
		"createdBy": "Christopher Baker",
		"createdOn": "22.07.2016",
		"rating": 3,
		"preparationTime": "25 Minutes",
		"yield": "Makes 4 servings",
		"ingredients": "1 1/2 tablespoons butter, 1/3 cup sliced or slivered almonds, toasted, 1/4 cup light brown sugar, 1 tablespoon olive oil, 4 boneless, skinless chicken breasts, 1/4 teaspoon salt, 1/4 teaspoon freshly ground black pepper, 8 cups spinach, Strawberry Vinaigrette, 2 cups fresh strawberries, halved",
		"description": "Take advantage of summer's bountiful crop of strawberries with this light and refreshing meal of Grilled Chicken-and-Strawberry Salad.",
		"preparation": "Melt butter in a large nonstick skillet. Stir in almonds, sugar, and 1 tablespoon water. Cook, stirring constantly, 2 minutes or until sugar melts and coats almonds. Spoon almonds onto wax paper, and set aside. Preheat grill to medium-high heat (350° to 400°) or grill pan over medium-high heat. Brush oil evenly on chicken; sprinkle with salt and pepper. Grill chicken, turning once, 10 minutes or until cooked through. Cut into strips. Toss spinach with Strawberry Vinaigrette to taste. Top with chicken strips, strawberries, and reserved sugared almonds."
	}, {
		"id": 7,
		"name": "Chicken Enchilada Casserole",
		"category": "Casserole",
		"image": "images/chicken-enchilada-casserole-ck.jpg",
		"createdBy": "Jennifer Causey",
		"createdOn": "04.08.2016",
		"rating": 4,
		"preparationTime": "1 Hour",
		"yield": "Serves 8 (serving size: 1 piece)",
		"ingredients": "2 cups water, 6 black peppercorns, 1 large garlic clove, crushed, 1 bay leaf, 1 3/4 pounds skinless, boneless chicken breasts, 3/4 teaspoon kosher salt, 5 ounces Monterey Jack cheese, shredded and divided (about 1 1/4 cups), 4 green onions, thinly sliced, 1 cup chopped fresh cilantro, 1 1/2 pounds fresh tomatillos, chopped, 1 (4-ounce) can chopped green chiles, undrained, 1/4 cup half-and-half, 2 ounces 1/3-less-fat cream cheese, softened, Cooking spray, 15 (6-inch) corn tortillas, halved, 1/2 cup quartered cherry tomatoes, 1/4 cup cilantro leaves (optional)",
		"description": "These enchiladas are a cinch to assemble and easy to freeze--just cover one of the pans with foil. If you plan to serve a crowd, bake in one (13 x 9-inch) baking dish. The chicken stays moist throughout baking and reheating, thanks to a gentle poach and a creamy verde sauce. Fresh cilantro stems have tons of flavor; make sure to include them in the sauce.",
		"preparation": "Preheat oven to 350°. Bring 2 cups water, peppercorns, garlic, and bay leaf to a boil in a large saucepan. Add chicken to pan; reduce heat and simmer, partially covered, 15 minutes or until chicken is done, turning after 10 minutes. Place chicken on a plate; cool slightly. Remove garlic clove from pan; reserve. Shred chicken with 2 forks. Place chicken, salt, 3 ounces Monterey Jack cheese (about 3/4 cup), and green onions in a bowl; stir to combine. Place reserved garlic clove, cilantro, tomatillos, and chiles in the bowl of a food processor; process until finely chopped. Add half-and-half and cream cheese; process until smooth. Coat 2 (8-inch) square glass or ceramic baking dishes with cooking spray. Spread 1/2 cup tomatillo sauce in the bottom of each dish. Arrange 5 tortilla halves over sauce in each dish; top each dish with one-fourth of chicken mixture. Repeat layers once, ending with tortillas and remaining tomatillo sauce. Sprinkle evenly with remaining 2 ounces Monterey Jack (about 1/2 cup). Bake at 350° for 15 minutes. Continue baking at 350° for 10 minutes, or remove 1 dish from oven and follow freezing directions. Divide each dish into 4 pieces. Place 1 piece on each of 8 plates; sprinkle evenly with tomato and cilantro leaves, if desired. Serve immediately."
	}, {
		"id": 8,
		"name": "Chicken, Broccoli, and Brown Rice Casserole",
		"category": "Casserole",
		"image": "images/chicken-broccoli-brown-rice-casserole-ck.jpg",
		"createdBy": "Jennifer Causey",
		"createdOn": "18.08.2016",
		"rating": 3,
		"preparationTime": "30 Minutes",
		"yield": "Serves 4 (serving size: about 2 cups)",
		"ingredients": "2 (3 1/2-ounce) bags boil-in-bag brown rice, 1 tablespoon olive oil, 1 small onion, finely chopped (about 1 cup), 8 ounces presliced button mushrooms, 8 ounces skinless, boneless chicken thighs, cut into bite-sized pieces, 3/4 teaspoon salt, divided, 1/4 teaspoon freshly ground black pepper, 1 (12-ounce) bag microwave-in-bag fresh broccoli florets, 1 1/2 cups 1% low-fat milk, 3 tablespoons all-purpose flour, 3 ounces sharp cheddar cheese, shredded (about 3/4 cup)",
		"description": "This healthy whole-grain spin on a comfort food classic is indulgent, creamy, and a guaranteed family-pleaser. ",
		"preparation": "Preheat broiler to high. Cook rice according to package directions; drain. While rice cooks, heat a large 12-inch ovenproof skillet over medium-high heat. Add oil to pan; swirl to coat. Add onion, mushrooms, and chicken; sprinkle with 1/4 teaspoon salt and pepper. Sauté 6 minutes or until chicken and onion are done. Cook broccoli in microwave according to package directions for 3 minutes. Open package to release steam. Combine milk and flour, stirring with a whisk or fork until smooth. Stir milk mixture into chicken mixture in skillet. Cook 2 minutes or until bubbly and thick, stirring frequently. Stir in remaining 1/2 teaspoon salt, rice, and broccoli. Sprinkle with cheese. Broil 1 minute or until cheese melts and just begins to brown."
	}]
}